app/controllers/coach_controller.rb

  def lessons
    lessons = Lesson.where(coachId: coach_params[:id])
---
SELECT "lessons".* FROM "lessons" WHERE "lessons"."coachId" = ?  [["coachId", 1]]