app/controllers/lessons_controller.rb

SELECT "lessons".* FROM "lessons" WHERE "lessons"."studentId" IS NULL
---
  def index
    lessons = Lesson.where(studentId: nil)

INSERT INTO "lessons" ("title", "description", "coachId", "date", "time", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "asdf"], ["description", "asefasdfasf"], ["coachId", 1], ["date", "6/21/2024"], ["time", 8], ["created_at", "2024-06-15 01:36:10.354169"], ["updated_at", "2024-06-15 01:36:10.354169"]]
---
  def create
    lesson = Lesson.create!(lesson_params)

SELECT "lessons".* FROM "lessons" WHERE "lessons"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "lessons" SET "studentId" = ?, "updated_at" = ? WHERE "lessons"."id" = ?  [["studentId", 1], ["updated_at", "2024-06-15 01:05:02.569347"], ["id", 3]]
---
  def update
    lesson = Lesson.find(params[:lesson][:id])

    if lesson.update!({notes: params[:lesson][:notes], score: params[:lesson][:score]})