app/controllers/student_controller.rb

  def lessons
    lessons = Lesson.where(studentId: student_params[:id])
---
SELECT "lessons".* FROM "lessons" WHERE "lessons"."studentId" = ?  [["studentId", 1]]